//
//  ThreeAndFour.swift
//  HW2.5
//
//  Created by Sergii Kotyk on 12/10/21.



// задание 3. Как я понял то потоков всего 64 для одного процесса и различий между ними нет, создаете класс потока и переписываете функцию main()

// задание 4. Ну Dispatch Queue управление очередью в потоке. Назначение нужной очереди той или иной задаче в зависимости от приоритета выполнения.
// Operation Queues это операционные очереди. Операции в данном случае это блок дискретных едениц работы. так же как и для обычного случая есть основные очереди и пользовательские.
// Run Loops похожи на очереди только в этом случае при окончании прохождения по всему что в очереде она делает это заново.
